Repository: Focus3D/crunchy
Catalog: tags/1.0pre-alpha-toulibre/translations/*/LC_MESSAGES/crunchy.po
Languages: de

source: (Fixed) User home directory:
de: (Festgelegt) Heimverzeichnis des Benutzers:

source: (Fixed) Temporary working directory:
de: (Festgelegt) Temporäres Arbeitsverzeichnis:

source: Invalid choice for %s.dir_help
de: Ungültige Auswahl für %s.dir_help

source: The valid choices are:
de: Die gültigen Auswahlmöglichkeiten sind:

source: The current value is:
de: Der aktuelle Wert ist:

source: The choices for dir_help are %s
de: Die Auswahlmöglichkeiten für dir_help sind %s

source: The current value is:
de: Der aktuelle Wert ist:

source: Invalid choice for %s.doc_help
de: Ungültige Auswahl für %s.doc_help

source: The choices for doc_help are %s
de: Die Auswahlmöglichkeiten für doc_help sind %s

source: You can change some of the default values by Crunchy, just like you can obtain this help message, using either an interpreter prompt or an editor, and assigning the desired value to a given variable. Some of these variables are "fixed", which means that their value can not be changed by the user. - Here are the values of some variables currently used by Crunchy.
de: Sie können einige der Vorgabewerte von Crunchy ändern, genau wie Sie sich diese Hilfsnachricht anzeigen lassen können, indem Sie entweder eine Interpreter-Kommandozeile oder einen Editor verwenden, um einer vorhandenen Variable die gewünschten Werte zuzuweisen. Einige Werte dieser Variablen sind festgelegt, dh. vom Benutzer nicht veränderbar. - Im Folgenden ein paar Werte einiger Variablen, welche momentan von Crunchy verwendet werden.

source: Invalid choice for %s.no_markup
de: Ungültige Auswahl für %s.no_markup

source: with "image_file file_name" as a required option.
de: mit "image_file file_name" als erforderlicher Option.

source: The choices for "pre" tag without Crunchy markup are %s
de: Die Auswahlmöglichkeiten für das "pre" Tag ohne Crunchy markup sind %s

source: language set to:
de: Sprache gesetzt auf:

source: editarea_language also set to:
de: editarea_language ist gesetzt auf:

source: Note: while this is a valid choice, this choice is not available for a language provided by editarea.
de: Bemerkung: Obwohl dies eine gültige Auswahlmöglichkeit ist, steht sie nicht für eine Sprache der editarea zur Verfügung.

source: The language choice for editarea remains
de: Die Sprachauswahl fuer editarea steht noch aus.

source: Invalid choice for %s.language
de: Ungültige Auswahl für %s.language

source: The choices for language are %s
de: Die Auswahlmöglichkeiten für Sprachen sind %s

source: editarea_language set to:
de: editarea_language gesetzt auf:

source: Invalid choice for %s.editarea_language
de: Ungültige Auswahl für %s.editarea_language

source: The choices for editarea_language are %s
de: Die Auswahlmöglichkeiten für editarea_language sind %s

source: Crunchy will attempt to provide friendly error messages.
de: Crunchy wird versuchen freundliche Fehlermeldungen auszugeben.

source: Crunchy's error messages will be similar to Python's default tracebacks.
de: Crunchys Fehlermeldungen werden ähnlich wie Pythons default tracebacks sein.

source: friendly attribute must be set to True or False.
de: Das Attribut 'freundlich' muss auf True oder False gesetzt sein.

source: The choices for friendly tracebacks are %s
de: Die Auswahlmöglichkeiten für freundliche Tracebacks sind %s

source: site security set to:
de: Seitensicherheit auf folgendes Niveau gesetzt:

source: Invalid choice for %s.site_security
de: Ungültige Auswahl für %s.site_security

source: security set to:
de: Sicherheit auf folgendes Niveau gesetzt:

source: Invalid choice for %s.local_security
de: Ungültige Auswahl für %s.local_security

source: The choices for local_security levels are %s
de: Die Auswahlmöglichkeiten für local_security sind %s

source: override_default_interpreter set to:
de: override_default_interpreter gesetzt auf:

source: Invalid choice for %s.override_default_interpreter
de: Ungültige Auswahl für %s.override_default_interpreter

source: The choices for override_default_interpreter are %s
de: Die Wahlmöglichkeiten für override_default_interpreter sind %s

source: my_style set to:
de: my_style ist auf gesetzt auf:

source: Invalid choice for %s.my_style
de: Ungültige Auswahl für %s.my_style

source: The choices for my_style are %s
de: Die Auswahlmöglichkeiten für my_style sind %s

source: If set to True, Crunchy's default styles are replaced
de: Wenn dieser Wert auf True gesetzt ist, werden Crunchys Vorgabewerte

source: by the user's choice specified in %s.styles
de: mit denen des Benutzer ersetzt, festgelegt in %s.styles

source: The current value for my_style is:
de: Der aktuelle Wert für my_style ist:

source: Your program tried to exit Crunchy.
de: Ihr Programm hat versucht Crunchy zu beenden.

source: Error on line
de: Fehler in Zeile

source: called by line
de: aufgerufen von Zeile

source: User's code
de: Code vom Benutzer

source: Error on line %s:
de: Fehler in Zeile %s:

source: There was no test to satisfy.
de: Es gab keinen zufriedenstellenden Test.

source: Congratulations, your code passed the test!
de: Glückwunsch, Ihr Code hat den Test bestanden!

source: You code failed the test.
de: Ihr Code hat den Test nicht bestanden.

source: Congratulations, your code passed all (%d) tests!
de: Glückwunsch, Ihr Code hat alle (%d) Tests bestanden.

source: Your code failed all (%d) tests.
de: Ihr Code hat keinen der (%d) Tests bestanden.

source: Your code failed %s out of %s tests.
de: Ihr Code hat %s von %s Test bestanden.

source: The following example failed:
de: Das folgende Beispiel ist fehlgeschlagen:

source: The expected result was:
de: Das erwartete Ergebnis war:

source: The result obtained was:
de: Das erhaltene Ergebnis war:

source: An exception was raised:
de: Eine Ausnahme wurde verursacht:

source: # no code entered by user
de: # kein Code vom Benutzer eingegeben

source: Crunchy: could not style the following code
de: Crunchy: konnte den folgenden Code nicht stylen

source: Parsing error occurred in the following Python code. Info: %s.
de: Beim parsen ist im folgenden Python-Code ein Fehler aufgetreten. Info: %s.

source: Load Python file
de: Python-Datei laden

source: Cancel
de: Abbrechen

source: Use 'Save and Run' to execute programs (like pygame and GUI based ones) externally.
de: Verwenden Sie 'Speichern und Ausführen' um Programme extern auszuführen (wie pygame und GUI basierende).

source: Save Python file
de: Python-Datei speichern

source: Save and Run
de: Speichern und Ausführen

source: Directory Listing
de: Verzeichnisauflistung

source: Illegal path, page not found.
de: Ungültiger Pfad, Seite nicht gefunden.

source: Crunchy could not open the page you requested. This could be for one of anumber of reasons, including:
de: Crunchy konnte die von Ihnen geforderte Seite nicht öffnen. Das könnte einen von vielen Gründen haben, zum Beispiel:

source: The page doesn't exist.
de: Die Seite existiert nicht.

source: The path you requested was illegal, examples of illegal paths include those containing the .. path modifier.
de: Der von Ihnen verlangte Pfad war ungültig. Ein ungültiger Pfad enthält zum Beispiel den Path Modifier .. (als Pfadelement).

source: The path you requested was:
de: Der von Ihnen geforderte Pfad war:

source: Execute
de: Ausführen

source: Copy code sample
de: Code-Beispiel kopieren

source: Crunchy security level:
de: Crunchy Sicherheitsstufe:

source: No elements were removed.
de: Keine Elemente entfernt.

source: One element was removed. -
de: Ein Element wurde entfernt. -

source: %d elements were removed. -
de: %d Elemente wurden entfernt. -

source: View report
de: Bericht anzeigen

source: Confirm the security levels
de: Sicherheitsniveaus bestätigen

source: Before browsing any further ...
de: Vor dem weitersurfen...

source: Do you wish to retain the existing settings for these sites?
de: Möchten Sie die bestehenden Einstellungen für diese Seiten speichern?

source: You can change any of them before clicking on the approve button.
de: Sie koennen jede Einstellung vor dem Bestätigen ändern.

source: Approve
de: Bestätigen

source: Remove all
de: Alle entfernen

source: remove from list
de: Aus der Liste entfernen

source: Removed: tag not allowed
de: Entfernt: Tag nicht erlaubt

source: Tag removed
de: Tag entfernt

source: Number of times
de: Anzahl

source: Removed: attribute, or attribute value not allowed
de: Entfernt: Attribut oder Attributwert nicht erlaubt

source: Attribute
de: Attribut

source: Value (if relevant)
de: Wert (wenn relevant)

source: Removed: style tag or attribute not allowed
de: Entfernt: Style-Tag oder Attribut nicht erlaubt

source: Attribute (if relevant)
de: Attribut (wenn relevant)

source: Value
de: Wert

source: You may select a site specific security level:
de: Seitenspezifisches Sicherheitsniveau auswaehlen:

source: If you want to preserve the existing selection,
de: Wenn Sie die momentane Auswahl speichern möchten,

source: simply dismiss this window by clicking on the X above.
de: schließen Sie dieses Fenster einfach durch einen Klick auf das X (oben).

source: Select site security level
de: Sicherheitsniveau der Seite auswählen

source: Selection of a 'display MODE' will result in the same processing by Crunchy as the selection of 'MODE' except that no interactive elements (such as a Python interpreter) will be inserted in the page, thereby preserving the normal browser sandbox to protect your computer from malicious code.
de: Die Auswahl eines 'display MODE' wird dieselbe Bearbeitung durch Crunchy erfahren, wie die Auswahl von 'MODE', abgesehen davon,, dass keine interaktiven Elemente (wie zum Beispiel ein Python Interpeter) in die Seite eingefügt werden. Dabei bleibt der normale "Sandkasten" (Sandbox) im Browser erhalten, um Ihren Computer vor böshaftem Code zu schützen.

source: Crunchy will remove any pre-existing javascript code on the page as well as a number of html elements that could be used to hide some javascript code.
de: Crunchy wird jeden bestehenden Javascript Code und eine Vielzahl von HTML-Elementen, welche dazu verwendet werden könnten, Javascript Code zu verstecken, von der Seite entfernen.

source: 'trusted' should only be used for sites that you are convinced will not attempt to insert malicious code. Sites that allow users to post comments, or worse, that allow users to edit (such as wikis) should not be set to 'trusted'. With 'trusted' selected, Crunchy will display the site as closely as it can to the wayt the original looked using only your browser.
de: 'trusted' sollte lediglich für Seiten verwendet werden, von welchen Sie mit Sicherheit sagen können, dass kein böswilliger Code eingefügt wird. Seiten, welchen es Benutzern erlauben Kommentare zu verfassen, oder, noch schlimmer, es ihnen erlauben Dinge zu bearbeiten (wie zum Beispiel in Wikis), sollten nicht auf 'trusted' gesetzt werden. Wenn 'trusted' gesetzt ist, wird Crunchy die Seite dem Original so ähnlich wie möglich darstellen, indem es lediglich Ihren Browser verwendet.

source: 'normal' will attempt to display the sites the same ways as 'trusted' does except that it will remove any styling deemed suspicious (see the docs for details) and will validate any image source before allowing the image to be displayed. If the site contains many images, this validation process will slow down the display. Images that can not be validated will not be shown. Each image is validated only once during a given Crunchy session.
de: 'normal' wird versuchen die Seiten wie 'trusted' anzuzeigen bis auf dass er jedes verdächtige Styling entfernen wird (näheres dazu in Dokumentation). Des Weiteren wird 'normal' jede Bildquelle validieren, bevor das Bild angezeigt werden darf. Wenn die Seite viele Bilder enthält, wird der Validierungsprozess die Anzeige verlangsamen. Bilder, welche nicht validiert werden können, werden nicht angezeigt. Jedes Bild ist wird nur während einer festgelegten Crunchy Sitzung validiert.

source: 'strict' will remove all styling and image on the page. It will result in the fastest display, but one that will likely be the least visually appealing.
de: 'strict' wird jedes Styling und alle Bilder von der Seite entfernen. Sie wird am schnellsten Angezeigt werden, jedoch am wenigsten optisch ansprechen.

source: Confirmation code:
de: Bestätigungs Code:

source: builtins not defined in console yet.
de: Die "builtins" sind noch nicht in der Konsole festgelegt.

source: Execute as external program
de: Als externes Programm ausführen

source: Execute as separate thread
de: Als seperaten Thread ausführen.

source: Type %s.help for more information.
de: %s.help für mehr Informationen.
