Repository: Focus3D/crunchy
Catalog: gsoc_2009/crunchy/translations/*/LC_MESSAGES/crunchy.po
Languages: pt_br

source: (Fixed) User home directory:
pt_br: (Fixo) Diretório do usuário:

source: (Fixed) Temporary working directory:
pt_br: (Fixo) Diretório de trabalho temporário:

source: Invalid choice for %s.dir_help
pt_br: Escolha inválida para %s.dir_help

source: The valid choices are:
pt_br: As escolhas válidas são:

source: The current value is:
pt_br: O valor atual é:

source: The choices for dir_help are %s
pt_br: As escolhas para dir_help são %s

source: The current value is:
pt_br: O valor atual é:

source: Invalid choice for %s.doc_help
pt_br: Escolha inválida para %s.doc_help

source: The choices for doc_help are %s
pt_br: As escolhas para doc_help são %s

source: You can change some of the default values by Crunchy, just like you can obtain this help message, using either an interpreter prompt or an editor, and assigning the desired value to a given variable. Some of these variables are "fixed", which means that their value can not be changed by the user. - Here are the values of some variables currently used by Crunchy.
pt_br: Você pode tanto trocar algum valor padrão do Crunchy, quanto obter esta mensagem de ajuda, utilizando tanto um interpretador ou um editor, atribuindo o valor desejado para a determinada variável. Algumas dessas variáveis são "fixas", o que significa que seus valores não podem ser mudados pelo usuário. - Aqui estão os valores de algumas variáveis usadas pelo Crunchy neste momento.

source: Invalid choice for %s.no_markup
pt_br: Escolha inválida para %s.no_markup

source: with "image_file file_name" as a required option.
pt_br: com "image_file file_name" como uma opção necessária.

source: The choices for "pre" tag without Crunchy markup are %s
pt_br: As escolhas para a tag "pre" sem a formatação do Crunchy são %s

source: language set to:
pt_br: idioma configurado para:

source: editarea_language also set to:
pt_br: editarea_language também configurado para:

source: Note: while this is a valid choice, this choice is not available for a language provided by editarea.
pt_br: Nota: ainda que esta seja uma opção válida, ela não está disponível para o idioma provido pelo editarea.

source: The language choice for editarea remains
pt_br: O idioma escolhido para o editarea permanece

source: Invalid choice for %s.language
pt_br: Escolha inválida para %s.language

source: The choices for language are %s
pt_br: As escolhas para idioma são %s

source: editarea_language set to:
pt_br: editarea_language configurado para:

source: Invalid choice for %s.editarea_language
pt_br: Escolha inválida para %s.editarea_language

source: The choices for editarea_language are %s
pt_br: As escolhas para editarea_language são %s

source: Crunchy will attempt to provide friendly error messages.
pt_br: Crunchy vai tentar fornecer mensagens de erro amigáveis.

source: Crunchy's error messages will be similar to Python's default tracebacks.
pt_br: Mensagens de erro do Chunchy serão similares ao padrão das tracebacks do Python.

source: friendly attribute must be set to True or False.
pt_br: o atributo amigável deve ser configurado como Verdadeiro ou Falso.

source: The choices for friendly tracebacks are %s
pt_br: As escolhas para traceback amigável são %s

source: site security set to:
pt_br: segurança do site configurada para:

source: Invalid choice for %s.site_security
pt_br: Escolha inválida para %s.site_security

source: security set to:
pt_br: segurança configurada para:

source: Invalid choice for %s.local_security
pt_br: Escolha inválida %s.local_security

source: The choices for local_security levels are %s
pt_br: As escolhas para local_security são %s

source: override_default_interpreter set to:
pt_br: override_default_interpreter configurado para:

source: Invalid choice for %s.override_default_interpreter
pt_br: Escolha inválida para %s.override_default_interpreter

source: The choices for override_default_interpreter are %s
pt_br: As escolhas para override_default_interpreter são %s

source: my_style set to:
pt_br: my_style configurado para:

source: Invalid choice for %s.my_style
pt_br: Escolha inválida para %s.my_style

source: The choices for my_style are %s
pt_br: As escolhas para my_style são %s

source: If set to True, Crunchy's default styles are replaced
pt_br: Se configurado como Verdadeiro, os estilos padrão do Crunchy serão trocados

source: by the user's choice specified in %s.styles
pt_br: pela escolha do usuário especificada em %s.styles

source: The current value for my_style is:
pt_br: O valor atual para my_style é:

source: Your program tried to exit Crunchy.
pt_br: O seu programa tentou fechar o Crunchy.

source: Error on line
pt_br: Erros na linha

source: called by line
pt_br: invocado pela linha

source: User's code
pt_br: Código do usuário

source: Error on line %s:
pt_br: Erros na linha %s:

source: There was no test to satisfy.
pt_br: Não existem testes para satisfazer.

source: Congratulations, your code passed the test!
pt_br: Parabéns, seu código passou no teste!

source: You code failed the test.
pt_br: Seu código falhou no teste.

source: Congratulations, your code passed all (%d) tests!
pt_br: Parabéns, seu código passou todos os (%d) testes!

source: Your code failed all (%d) tests.
pt_br: Seu código falhou em todos os (%d) testes.

source: Your code failed %s out of %s tests.
pt_br: Seu código falhou em %s de %s testes.

source: The following example failed:
pt_br: O exemplo seguinte falhou:

source: The expected result was:
pt_br: O resultado esperado era:

source: The result obtained was:
pt_br: O resultado obtido foi:

source: An exception was raised:
pt_br: Uma exceção foi instanciada:

source: # no code entered by user
pt_br: # nenhum código inserido pelo usuário

source: Crunchy: could not style the following code
pt_br: Crunchy: impossível estilizar o seguinte código

source: Parsing error occurred in the following Python code. Info: %s.
pt_br: Erro de parsing do seguinte código Python. Info: %s.

source: Load Python file
pt_br: Carregando arquivo Python

source: Cancel
pt_br: Cancelar

source: Use 'Save and Run' to execute programs (like pygame and GUI based ones) externally.
pt_br: Use 'Salvar e rodar' para executar programas (como pygame e outros baseados em GUI) externamente.

source: Save Python file
pt_br: Salvar o arquivo Python

source: Save and Run
pt_br: Salvar e rodar

source: Directory Listing
pt_br: Listagem do diretório

source: Illegal path, page not found.
pt_br: Caminho ilegal, página não encontrada.

source: Crunchy could not open the page you requested. This could be for one of anumber of reasons, including:
pt_br: Crunchy não pode abrir sua requisição. Isto pode ser causado por inúmeras razões, incluindo:

source: The page doesn't exist.
pt_br: A página não existe.

source: The path you requested was illegal, examples of illegal paths include those containing the .. path modifier.
pt_br: O caminho que você requisitou é ilegal, exemplos de caminhos ilegais incluem aqueles que contém o modificador de caminho ..

source: The path you requested was:
pt_br: O caminho que você requisitou foi:

source: Execute
pt_br: Executar

source: Copy code sample
pt_br: Copiar o código de exemplo

source: Crunchy security level:
pt_br: Nível de segurança do Crunchy:

source: No elements were removed.
pt_br: Nenhum elemento foi removido.

source: One element was removed. -
pt_br: Um elemento foi removido. -

source: %d elements were removed. -
pt_br: %d elementos foram removidos. -

source: View report
pt_br: Visualizar retorno

source: Confirm the security levels
pt_br: Confirmar os níveis de segurança

source: Before browsing any further ...
pt_br: Antes de navegar mais ...

source: Do you wish to retain the existing settings for these sites?
pt_br: Você quer manter as configurações para estes sites?

source: You can change any of them before clicking on the approve button.
pt_br: Você pode trocar qualquer um deles antes de clicar no botão Aprovar.

source: Approve
pt_br: Aprovar

source: Remove all
pt_br: Remover tudo

source: remove from list
pt_br: remover da lista

source: Removed: tag not allowed
pt_br: Removido: tag não permitida

source: Tag removed
pt_br: Tag removida

source: Number of times
pt_br: Número de tentativas

source: Removed: attribute, or attribute value not allowed
pt_br: Removido: atributo, ou valor do atributo não permitido

source: Attribute
pt_br: Atributo

source: Value (if relevant)
pt_br: Valor (se necessário)

source: Removed: style tag or attribute not allowed
pt_br: Removido: tag de estilo ou atributo não permitido

source: Attribute (if relevant)
pt_br: Atributo (se necessário)

source: Value
pt_br: Valor

source: You may select a site specific security level:
pt_br: Você pode selecionar um site especificando um nível de segurança:

source: If you want to preserve the existing selection,
pt_br: Se você quer preservar a seleção atual,

source: simply dismiss this window by clicking on the X above.
pt_br: simplesmente ignore esta janela clicando no X acima.

source: Select site security level
pt_br: Selecione o nível de segurança do site

source: Selection of a 'display MODE' will result in the same processing by Crunchy as the selection of 'MODE' except that no interactive elements (such as a Python interpreter) will be inserted in the page, thereby preserving the normal browser sandbox to protect your computer from malicious code.
pt_br: A seleção do 'display MODE' resultará no mesmo comportamento do Crunchy da seleção 'MODE' exceto que nenhum elemento interativo (como o interpretador do Python) será inserido na página, de tal modo preservando o sandbox normal do browser para proteger o seu computador de código malicioso.

source: Crunchy will remove any pre-existing javascript code on the page as well as a number of html elements that could be used to hide some javascript code.
pt_br: Crunchy removerá qualquer código em javascript já existente na página como também um número de elementos html que podem ser usados para esconder algum código javascript.

source: 'trusted' should only be used for sites that you are convinced will not attempt to insert malicious code. Sites that allow users to post comments, or worse, that allow users to edit (such as wikis) should not be set to 'trusted'. With 'trusted' selected, Crunchy will display the site as closely as it can to the wayt the original looked using only your browser.
pt_br: 'trusted' deve ser utilizado apenas para sites que você está convencido de que não tentarão inserir código malicioso. Sites que permitem aos usuários postar comentários, ou pior, que permitem aos usuários editar o conteúdo (como se fosse uma wiki) não devem ser configurados como 'trusted'. Selecionando 'trusted', Crunchy mostrará o site o quão próximo ele puder do jeito que mostraria o seu browser.

source: 'normal' will attempt to display the sites the same ways as 'trusted' does except that it will remove any styling deemed suspicious (see the docs for details) and will validate any image source before allowing the image to be displayed. If the site contains many images, this validation process will slow down the display. Images that can not be validated will not be shown. Each image is validated only once during a given Crunchy session.
pt_br: 'normal' tentará mostrar os sites do mesmo jeito que 'trusted' faria exceto que são removidos qualquer código de estilo suspeito (veja a documentação para detalhes) e tentará validar a procedência de qualquer imagem antes de permitir que sejam visualizadas. Se o site contém muitas imagens, esta validação deixará um pouco lenta a visualização. As imagens que não puderem ser validadas não serão mostradas. Cada imagem será validada apenas uma vez durante cada sessão do Crunchy.

source: 'strict' will remove all styling and image on the page. It will result in the fastest display, but one that will likely be the least visually appealing.
pt_br: 'strict' removerá todo o estilo e imagem da página. Isto resultará em uma visualização mais rápida, mas poderá possivelmente tornar o menos atraente visivelmente.

source: Host:
pt_br: Endereço:

source: Confirmation code:
pt_br: Código de confirmação:

source: builtins not defined in console yet.
pt_br: builtins não foram definidos no console ainda.

source: Execute as external program
pt_br: Executar como um programa externo

source: Execute as separate thread
pt_br: Executar como uma thread separada

source: Type %s.help for more information.
pt_br: Digite %s.help para mais informações
