Repository: Focus3D/crunchy
Catalog: translations/*/LC_MESSAGES/crunchy.po
Languages: hu

source: (Fixed) User home directory:
hu: (Megjavítva) Felhasználó könyvtára:

source: (Fixed) Temporary working directory:
hu: (Megjavítva) Ideiglenes munkamappa:

source: Invalid choice for %s.dir_help
hu: Érvénytelen választás: %s.dir_help

source: The valid choices are:
hu: A helyes választási lehetőségek:

source: The current value is:
hu: A jelenlegi érték:

source: The choices for dir_help are %s
hu: A dir_help választási lehetőségei: %s

source: The current value is:
hu: A jelenlegi érték:

source: Invalid choice for %s.doc_help
hu: Érvénytelen választás a következőhöz: %s.doc_help

source: The choices for doc_help are %s
hu: A választási lehetőségek a doc_help -hez: %s

source: You can change some of the default values by Crunchy, just like you can obtain this help message, using either an interpreter prompt or an editor, and assigning the desired value to a given variable. Some of these variables are "fixed", which means that their value can not be changed by the user. - Here are the values of some variables currently used by Crunchy.
hu: Megváltoztathatsz néhány Crunchy által megadott értéket, úgy ahogy elérheted ezt a súgóüzenetet is, egy interpretert, egy parancssort, vagy egy szerkesztőt használva, és megadhatod a megfeleő értéket egy adott változónak. Néhány változó "fixed", ami azt jelenti, hogy értéke nem változtatható meg a felhasználó által. - Néhány változó értéke amit a Crunchy épp használ:

source: Invalid choice for %s.no_markup
hu: Érvénytelen választás: %s.no_markup

source: with "image_file file_name" as a required option.
hu: "image_file file_name" -el, mint egy szükséges opció.

source: The choices for "pre" tag without Crunchy markup are %s
hu: A választási lehetőségek a "pre" címkére Crunchy megjelölés nélkül a következők %s

source: language set to:
hu: A használt nyelv:

source: editarea_language also set to:
hu: A szerkesztőfelület által használt nyelv:

source: Note: while this is a valid choice, this choice is not available for a language provided by editarea.
hu: Megjegyzés: Ez egy érvényes választás, de ez a választás nem elérhető a szerkesztőterület által megadott nyelv számára.

source: The language choice for editarea remains
hu: A nyelvválasztás a szerkesztőterület számaára a következő marad:

source: Invalid choice for %s.language
hu: Érvénytelen választás a %s.language számára

source: The choices for language are %s
hu: A nyelvi választási lehetőségek %s

source: editarea_language set to:
hu: Szerkesztőterület nyelve (editarea_language) beálítva:

source: Invalid choice for %s.editarea_language
hu: Érvénytelen választás a következőre: %s.editarea_language

source: The choices for editarea_language are %s
hu: A választási lhetőségek az editarea_language számára: %s

source: Crunchy will attempt to provide friendly error messages.
hu: A Crunchy megpróbál barátságos hibaüzeneteket adni.

source: Crunchy's error messages will be similar to Python's default tracebacks.
hu: A Crunchy hibaüzentei hasonlóak a Python alapértelmezett üzeneteihez.

source: friendly attribute must be set to True or False.
hu: A friendly attribute (barátságos tulajdonság) igazra (True) vagy hamisra (False) kell legyen állítva.

source: The choices for friendly tracebacks are %s
hu: A választási lehetőségek a barátságos nyomonkövetéshez a következők: %s

source: site security set to:
hu: Oldalbiztonág beállítva:

source: Invalid choice for %s.site_security
hu: Érvénytelen választás a %s.site_security -re

source: security set to:
hu: Biztonság beállítva:

source: Invalid choice for %s.local_security
hu: Érvénytelen választás a %s.local_security -re

source: The choices for local_security levels are %s
hu: A választási lehetőségek a helyi biztonségi szintekre a következők: %s

source: override_default_interpreter set to:
hu: override_default_interpreter beállítása:

source: Invalid choice for %s.override_default_interpreter
hu: Érvénytelen választás a %s.override_default_interpreter számára

source: The choices for override_default_interpreter are %s
hu: A választási lehetőségek az override_default_interpreter számára: %s

source: my_style set to:
hu: my_style beállítása:

source: Invalid choice for %s.my_style
hu: Érvénytelen választás a %s.my_style -ra

source: The choices for my_style are %s
hu: A választási lehetőségek a my_style -ra: %s

source: If set to True, Crunchy's default styles are replaced
hu: Ha igazra van állítva a Crunchy alapértelmezett stílusai lecseélődnek

source: by the user's choice specified in %s.styles
hu: a felhasználó választása alapján megadva a %s.styles -ben

source: The current value for my_style is:
hu: A my_style jelenlegi értéke:

source: Your program tried to exit Crunchy.
hu: A programod megpróbált kilépni a Crunchyból.

source: Error on line
hu: Hiba a sorban:

source: called by line
hu: meghívva a sor által:

source: User's code
hu: A felhasználó kódja

source: Error on line %s:
hu: Hiba a %s. sorban:

source: There was no test to satisfy.
hu: Nem volt kielégítendő teszt.

source: Congratulations, your code passed the test!
hu: Gratulálunk a kódod átment a teszeten.

source: You code failed the test.
hu: A kódod megbukott a teszten.

source: Congratulations, your code passed all (%d) tests!
hu: Gratulálunk a kódod átment mind a(z) %d teszten!

source: Your code failed all (%d) tests.
hu: A kódod megbukott mind a(z) %d teszten.

source: Your code failed %s out of %s tests.
hu: A kódod megbukott %s teszten a %s tesztből.

source: The following example failed:
hu: A következő példa megbukott:

source: The expected result was:
hu: A várt eredmény a következő volt:

source: The result obtained was:
hu: A megszerzett eredmény:

source: An exception was raised:
hu: Egy kivétel lépett fel:

source: # no code entered by user
hu: # számú kód a felhasználó által megadva

source: Crunchy: could not style the following code
hu: Crunchy: nem tudtam formázni a következő kódot

source: Parsing error occurred in the following Python code. Info: %s.
hu: Elemzési hiba a következő Python kódban. Info: %s.

source: Load Python file
hu: Python fájl betöltése

source: Cancel
hu: Mégse

source: Use 'Save and Run' to execute programs (like pygame and GUI based ones) externally.
hu: Használd a 'Mentés és Futtatás' opciót a programfuttatáshoz (mint a pygame és a GUI alapúak) kívülről.

source: Save Python file
hu: Python fájl mentése

source: Save and Run
hu: Mentés és Futtatás

source: Directory Listing
hu: Könyvtárlistázás

source: Illegal path, page not found.
hu: Érvénytelen útvonal, oldal nem található.

source: Crunchy could not open the page you requested. This could be for one of anumber of reasons, including:
hu: A Crunchy nem tudja megnyitni a kívánt oldalt. Ez következő hibák miatt lehetséges:

source: The page doesn't exist.
hu: Az oldal nem létezik.

source: The path you requested was illegal, examples of illegal paths include those containing the .. path modifier.
hu: A kért útvonal érvénytelen volt, érvénytelen útvonal például a .. -ot tratlamazó.

source: The path you requested was:
hu: A kért útvonal a következő volt:

source: Execute
hu: Futtatás

source: Copy code sample
hu: Kódpélda másolása

source: Crunchy security level:
hu: Crunchy biztonsági szint:

source: No elements were removed.
hu: Egy elem sem lett eltávolítva.

source: One element was removed. -
hu: Egy elem el lett távolítva. -

source: %d elements were removed. -
hu: %d elem lett eltávolítva. -

source: View report
hu: Jelentés megtekintése

source: Confirm the security levels
hu: Biztonsági szintek megerősítése

source: Before browsing any further ...
hu: Mielőtt tovább böngésznél ...

source: Do you wish to retain the existing settings for these sites?
hu: Meg szertnéd őrizni az ezen oldalak jelenlegi beállításait?

source: You can change any of them before clicking on the approve button.
hu: Bármelyiket megváltoztathatod a Jóváhagy gomb megnyomása előtt.

source: Approve
hu: Jóváhagy

source: Remove all
hu: Minet eltávolít

source: remove from list
hu: eltávolítás a listáról

source: Removed: tag not allowed
hu: Eltávolítva: címke nem engedélyezett

source: Tag removed
hu: Címke eltávolítva

source: Number of times
hu: Az idők száma

source: Removed: attribute, or attribute value not allowed
hu: Eltávolítva: attribútum, vagy attribútum értéke nem engedélyezett

source: Tag
hu: Címke

source: Attribute
hu: Attribútum

source: Value (if relevant)
hu: Érték (ha fontos)

source: Removed: style tag or attribute not allowed
hu: Eltávolítva: stíluscimke vagy attribútum nem engedélyezett

source: Attribute (if relevant)
hu: Attribútum (ha fontos)

source: Value
hu: Érték

source: You may select a site specific security level:
hu: Kiválaszthatsz egy oldalspecifikus biztonsági szintet:

source: If you want to preserve the existing selection,
hu: Ha meg akarod őrizni a létező választékot,

source: simply dismiss this window by clicking on the X above.
hu: egyszerűen zárd be ezt az ablakot.

source: Select site security level
hu: Válassz oldalbiztonsági szintet

source: Selection of a 'display MODE' will result in the same processing by Crunchy as the selection of 'MODE' except that no interactive elements (such as a Python interpreter) will be inserted in the page, thereby preserving the normal browser sandbox to protect your computer from malicious code.
hu: A 'display MODE' kiválasztása ugyanazt fogja eredményezni a Crunchy-ban amit a 'MODE' kiválasztása kivéve, hogy egyetlen interaktív elem (mint pl. egy Python interpreter) sem lesz beillesztve az oldalra, ezért megőrzi a normál bongésző sandboxot, hogy megvédje a gépet a rosszindulatú kódoktól.

source: Crunchy will remove any pre-existing javascript code on the page as well as a number of html elements that could be used to hide some javascript code.
hu: A Crunchy el fogja távolítani ez összes most létező javascript kódot az oldalról, és néhány html elemet is amely a javascript kódok elrejtésére szolgálhat.

source: 'trusted' should only be used for sites that you are convinced will not attempt to insert malicious code. Sites that allow users to post comments, or worse, that allow users to edit (such as wikis) should not be set to 'trusted'. With 'trusted' selected, Crunchy will display the site as closely as it can to the wayt the original looked using only your browser.
hu: A 'megbízható' csak olyan oldalakkal kapcsolatban használandó ahol biztos, hogy az oldal nem próbál rosszindulatú kódot beilleszteni. Az olyan oldalakat amelyek engedik a felhasználóknak, hogy kommentelet küldjenek, vagy szerkesszék az oldalt (pl. wikik) nem szabad megbízhatóra állítani. A 'megbízható' beállítás esetén a Crunchy amennyire tudja annyira hasonlóan fogja megjeleníteni az oldalt az eredetihez a böngészővel.

source: 'normal' will attempt to display the sites the same ways as 'trusted' does except that it will remove any styling deemed suspicious (see the docs for details) and will validate any image source before allowing the image to be displayed. If the site contains many images, this validation process will slow down the display. Images that can not be validated will not be shown. Each image is validated only once during a given Crunchy session.
hu: A 'normális' úgy próbálja megjeleníteni az oldalt, mint a 'megbízható', csupán el fog távolítani minden gyanús stíluselemet (olvasd el a dok-ot részletekért) és érvényesíteni fogja a képforrásokat mielőtt engedélyezi a megjelenítést. Ha az oldal sok képet tartalmaz az érvényesítés le fogja lassítani a megjelenítést. A nem érvényesíthető képek nem fognak megjelenni. Egy Crunchy futás során egy képet egyszer érvényesít a program.

source: 'strict' will remove all styling and image on the page. It will result in the fastest display, but one that will likely be the least visually appealing.
hu: A 'szigorú' el fogja távolítani az összes stíluselemet és képet az oldalról. Gyors megjelenítést eredményez, de vizuálisan a legkevésbé vonzó.

source: Host:
hu: Hoszt:

source: Confirmation code:
hu: Megerősítő kód:

source: builtins not defined in console yet.
hu: Beépített elemek még nincsenek definiálva a konzolban.

source: Execute as external program
hu: Futtatás külső programként

source: Execute as separate thread
hu: Futtatás külön folyamatként

source: Type %s.help for more information.
hu: írd be a %s.help -et további információért.
