Repository: Focus3D/crunchy
Catalog: branches/andre/translations/*/LC_MESSAGES/crunchy.po
Languages: et

source: (Fixed) User home directory:
et: (Fikseeritud) Kasutaja kodukaust:

source: (Fixed) Temporary working directory:
et: (Fikseeritud) Ajutine töötamise kaust:

source: Invalid choice for %s.dir_help
et: Vale valik %s.dir_help 'is

source: The valid choices are:
et: Kehtivad valikud on:

source: The current value is:
et: Vale valik %s.dir_help 'is

source: The choices for dir_help are %s
et: Dir_help valikud on %s

source: The current value is:
et: Hetkene väärtus on:

source: Invalid choice for %s.doc_help
et: Vale valik %s.doc_help 'is

source: The choices for doc_help are %s
et: Doc_help valikud on %s

source: You can change some of the default values by Crunchy, just like you can obtain this help message, using either an interpreter prompt or an editor, and assigning the desired value to a given variable. Some of these variables are "fixed", which means that their value can not be changed by the user. - Here are the values of some variables currently used by Crunchy.
et: Sa saad muuta mõningaid Crunchy vaike väärtusi, just nagu saad sa siia abi teatesse, kasutades kas interpretaatorit käsurida või teksti redaktorit, määrates soovitud väärtuse antud muutujasse. Mõned neist muutujatest on "fikseeritud", mis tähendab seda et nende väärtust ei saa kasutaja muuta. - Siin on mõndade Crunchy poolt kasutatavate muutujate väärtused.

source: Invalid choice for %s.no_markup
et: Vale valik %s.no_markup 'is

source: with "image_file file_name" as a required option.
et: kasutades "pildi_nimi faili_nimi" kui nõutud valikut.

source: The choices for "pre" tag without Crunchy markup are %s
et: Valikud "pre" märgisele ilma Crunchy märgenduseta on %s

source: language set to:
et: keeleks pandud:

source: editarea_language also set to:
et: muuteala_keel ka pandud:

source: Note: while this is a valid choice, this choice is not available for a language provided by editarea.
et: Teade: kuigi see on sobiv valik, ei ole see valik siiski kehtiv muuteala poolt pakutud keelele.

source: The language choice for editarea remains
et: Muuteala keelevalikuna säilib

source: Invalid choice for %s.language
et: Vale valik %s.language 's

source: The choices for language are %s
et: Keelevalikud on %s

source: editarea_language set to:
et: muuteala_keel on pandud:

source: Invalid choice for %s.editarea_language
et: Vale valik %s.editarea_language

source: The choices for editarea_language are %s
et: Muuteala_keel valikud on %s

source: Crunchy will attempt to provide friendly error messages.
et: Crunchy üritab serveerida sulle ainult sõbralikke veateateid.

source: Crunchy's error messages will be similar to Python's default tracebacks.
et: Crunchy veateated on sarnased Pythoni traceback 'idele.

source: friendly attribute must be set to True or False.
et: sõbralik atribuut peab olema kas Tõsi või Vale.

source: The choices for friendly tracebacks are %s
et: Sõbralike traceback 'ide valikud on %s

source: site security set to:
et: lehe turvalisus seatud:

source: Invalid choice for %s.site_security
et: Vale valik %s.site_security 's

source: security set to:
et: turvalisus seatud:

source: Invalid choice for %s.local_security
et: Vale valik %s.local_security 's

source: The choices for local_security levels are %s
et: Valikud local_security jaoks on %s

source: override_default_interpreter set to:
et: override_default_interpreter pandud:

source: Invalid choice for %s.override_default_interpreter
et: Vale valik %s.override_default_interpreter 's

source: The choices for override_default_interpreter are %s
et: Valikud override_default_interpreter 'i jaoks on %s

source: my_style set to:
et: my_style pandud:

source: Invalid choice for %s.my_style
et: Vale valik %s.my_style 's

source: The choices for my_style are %s
et: Valikud my_style jaoks on %s

source: If set to True, Crunchy's default styles are replaced
et: Kui pandud Tõsi, siis Crunchy vaikimisi stiilid muudetakse

source: by the user's choice specified in %s.styles
et: kasutaja valiku kohaselt määratud %s.styles 'is

source: The current value for my_style is:
et: Hetkene väärtus my_style 'is on:

source: Your program tried to exit Crunchy.
et: Su programm üritas Crunchyst väljuda.

source: Error on line
et: Viga real

source: called by line
et: esilekutsutud rea poolt

source: User's code
et: Kasutaja kood

source: Error on line %s:
et: Viga real %s:

source: There was no test to satisfy.
et: Ei olnud ühtegi testi mida läbida.

source: Congratulations, your code passed the test!
et: Õnnitlused, su kood läbis testi!

source: You code failed the test.
et: Su kood ei läbinud testi.

source: Congratulations, your code passed all (%d) tests!
et: Õnnitlused, su kood läbis kõik (%d) testi!

source: Your code failed all (%d) tests.
et: Su kood ei läbinud ühtegi (%d) testi.

source: Your code failed %s out of %s tests.
et: Su kood ei läbinud %s 'e testi %s 'est.

source: The following example failed:
et: Järgnev näide ei läbinud:

source: The expected result was:
et: Oodatav tulemus oli:

source: The result obtained was:
et: Saadud tulemus oli:

source: An exception was raised:
et: Erand kerkis:

source: # no code entered by user
et: # kasutaja poolt ei sisestatud koodi

source: Crunchy: could not style the following code
et: Crunchy: ei suutnud stiliseerida järgnevat koodi

source: Parsing error occurred in the following Python code. Info: %s.
et: Parseerimis viga kerkis järgnevas Pythoni koodis. Info: %s.

source: Load Python file
et: Lae Pythoni fail

source: Cancel
et: Katkesta

source: Use 'Save and Run' to execute programs (like pygame and GUI based ones) externally.
et: Kasuta "Salvesta ja jooksuta", et käivitada programme (nagu pygame ja graafilisel liidesel põhinevaid) väliselt.

source: Save Python file
et: Salvesta Pythoni fail

source: Save and Run
et: Salvesta ja jooksuta

source: Directory Listing
et: Kausta Nimistu

source: Illegal path, page not found.
et: Illegaalne asukoht, lehte ei leitud.

source: Crunchy could not open the page you requested. This could be for one of anumber of reasons, including:
et: Crunchy ei suutnud avada soovitud lehte. Seda võisid põhjustada mitmed asjaolud, kaasaarvatud:

source: The page doesn't exist.
et: Leht ei eksisteeri.

source: The path you requested was illegal, examples of illegal paths include those containing the .. path modifier.
et: Soovitud asukoht on illegaalne, näited illegaalsetest asukohtades, kaasarvatud need mis sisaldavad .. liidest.

source: The path you requested was:
et: Soovitud asukoht oli:

source: Execute
et: Käivita

source: Copy code sample
et: Kopeeri koodi jupp

source: Crunchy security level:
et: Crunchy turvatase:

source: No elements were removed.
et: Ühtegi elementi ei eemaldatud.

source: One element was removed. -
et: Üks element eemaldati. -

source: %d elements were removed. -
et: %d elementi eemaldati. -

source: View report
et: Vaata raportit

source: Confirm the security levels
et: Kinnita turvatasemed

source: Before browsing any further ...
et: Enne sirvimise jätkamist ...

source: Do you wish to retain the existing settings for these sites?
et: Soovid sa säilitada nende lehtede olemasolevad sätted?

source: You can change any of them before clicking on the approve button.
et: Võid neid muuta igaüht vajutades Kinnita nupule.

source: Approve
et: Kinnita

source: Remove all
et: Eemalda kõik

source: remove from list
et: eemalda listist

source: Removed: tag not allowed
et: Eemaldatud: märge pole lubatud

source: Tag removed
et: Märge eemaldatud

source: Number of times
et: Kordade arv

source: Removed: attribute, or attribute value not allowed
et: Eemaldatud: atribuut või atribuudi väärtus pole lubatud

source: Tag
et: Märge

source: Attribute
et: Atribuut

source: Value (if relevant)
et: Väärtus (kui omab tähtsust)

source: Removed: style tag or attribute not allowed
et: Eemaldatud: stiili märge või atribuut pole lubatud

source: Attribute (if relevant)
et: Atribuut (kui omab tähtsust)

source: Value
et: Väärtus

source: You may select a site specific security level:
et: Võid valida lehe raames turvataseme:

source: If you want to preserve the existing selection,
et: Kui tahad säilitada olemasolevat valikut,

source: simply dismiss this window by clicking on the X above.
et: lihtsalt välju sellest aknast vajutades üleval X'i.

source: Select site security level
et: Vali lehe turvatase

source: Selection of a 'display MODE' will result in the same processing by Crunchy as the selection of 'MODE' except that no interactive elements (such as a Python interpreter) will be inserted in the page, thereby preserving the normal browser sandbox to protect your computer from malicious code.
et: Valides 'display MODE', valib sama ka Crunchy, kuna 'MODE' valik välistab ühegi interaktiivse elemendi (näiteks Pythoni interpreeter) sisestamise lehele, säilitades sellega normaalse brauseri turvatsooni, et kaitsta su arvutit kurja koodi eest.

source: Crunchy will remove any pre-existing javascript code on the page as well as a number of html elements that could be used to hide some javascript code.
et: Crunchy eemaldab lehelt juba olemasoleva javascript koodi ja ka mitmed html elemendid, mis võivad peita endas javascript koodi.

source: 'trusted' should only be used for sites that you are convinced will not attempt to insert malicious code. Sites that allow users to post comments, or worse, that allow users to edit (such as wikis) should not be set to 'trusted'. With 'trusted' selected, Crunchy will display the site as closely as it can to the wayt the original looked using only your browser.
et: 'trusted' peaks kasutama ainult lehtede puhul, milles ollakse kindlad, et nad ei ürita sisestada kurja koodi. Lehed mis lubavad kasutajatel postitada, kommenteerida, või hullemgi veel, mis lubavad kasutajatel lehe sisu muuta (näiteks wikid), ei tohiks olla 'trusted'. Kui 'trusted' valitud, näitab Crunchy seda lehte sinu brauseris nii originaali lähedaselt kui suudab.

source: 'normal' will attempt to display the sites the same ways as 'trusted' does except that it will remove any styling deemed suspicious (see the docs for details) and will validate any image source before allowing the image to be displayed. If the site contains many images, this validation process will slow down the display. Images that can not be validated will not be shown. Each image is validated only once during a given Crunchy session.
et: 'normal' üritab näidata lehti sarnaselt 'trusted' valikule, erandiga, et eemaldab kõik kahtlasena näivad stiili sätted (vaata dokumentatsiooni et lähemalt teada saada) ja valideerib kõik pildid, enne kui lubab pilti näidata. Kui leht sisaldab palju pilte, siis valideerimine võtab kuvamise kiirust alla. PIldid mille valideerimine ei õnnestu, ei saa kuvatud. Iga pilti valideeritakse iga Crunchy sessiooni jooksul vaid korra.

source: 'strict' will remove all styling and image on the page. It will result in the fastest display, but one that will likely be the least visually appealing.
et: 'strict' eemaldab lehelt kõik stiliseerimised ja pildid. See toob kaasa kiireima kuvamise, aga samas on see ka tõenäoliselt visuaalselt kõige vähem köitev.

source: Host:
et: Omanik:

source: Confirmation code:
et: Kinnitus kood:

source: builtins not defined in console yet.
et: sisseehitatud muutujad ei ole veel konsoolis defineeritud.

source: Execute as external program
et: Käivitatud välise programmina

source: Execute as separate thread
et: Käivitatud eraldiseisva haruna

source: Type %s.help for more information.
et: Trüki %s.help , et saada rohkem infot.
