Repository: Focus3D/crunchy
Catalog: branches/bryangsoc2007/crunchy/translations/*/LC_MESSAGES/crunchy.po
Languages: de

source: Parsing error occurred in the following Python code. Info: %s.
de: Eine Parsefehler ist in den folgenden Python Quelltext vorgekommen:%s

source: Load Python file
de: Python Datei Laden

source: Cancel
de: Abbrechen

source: Use 'Save and Run' to execute programs (like pygame and GUI based ones) externally.
de: Benutzen sie 'Save and Run' um Programme (z.b. pygame und GUI Programme) extern laufen zu lassen.

source: Save Python file
de: Python Datei Speichern

source: Directory Listing
de: Verzeichniss Inhalt

source: Illegal path, page not found.
de: Illegale Pfad, Datei wurde nicht gefunden.

source: Crunchy could not open the page you requested. This could be for one of anumber of reasons, including:
de: Crunchy könnte ihre seite nicht öffnen, das kann verschiedene Ursachen haben:

source: The page doesn't exist.
de: Die seite existiert nicht.

source: The path you requested was illegal, examples of illegal paths include those containing the .. path modifier.
de: Sie haben eine illegale Pfad beantragt, ein Beispiel von eine illegale Pfad ist eine der '..' beinhaltet.

source: The path you requested was:
de: Sie haben die folgenden Pfad beantragt:
