Repository: Focus3D/crunchy
Catalog: branches/andre/crunchy_locale/*/*.po
Languages: fr

source: Previous value
fr: Valeur précédente

source: Waiting...
fr: En attente...

source: Evaluate
fr: Évaluer

source: Execute externally
fr: Exécution externe

source: Draw
fr: Dessiner

source: Plot
fr: Graphique

source: Load local tutorial
fr: Didacticiel local

source: Load Python file
fr: Charger un fichier Python

source: Cancel
fr: Annuler

source: If you do not use
fr: Si vous n'utilisez pas

source: 'Save and Run'
fr: 'Sauvegarder et exécuter'

source: Python will use a temporary file when evaluating the script.
fr: Python utilisera un fichier temporaire pour évaluer votre programme.

source: Save Python file
fr: Sauvegarder

source: Save and Run
fr: Sauvegarder et exécuter

source: Load remote tutorial
fr: Didacticiel externe

source: Submit language choice
fr: Indiquez le choix de langue

source: Submit style choice
fr: Indiquez le choix de style

source: Update
fr: Mise à jour

source: Record changes
fr: Enregistrer les changements

source: Interactive element
fr: Élément interactif

source: Optional line numbering
fr: numérotation optionnelle de lignes

source: If interactive element is none:
fr: Si l'élément interactif est "none"

source: Size
fr: Grandeur

source: Size of editor (if present)
fr: Grandeur de l'éditeur (si présent)

source: Drawing area (if present)
fr: Aire du dessin (si présent)

source: Code execution
fr: Exécution du code

source: Optional values for editor only
fr: Valeurs optionnelles pour éditeur seulement

source: Rarely used options
fr: Options rarement utilisées

source: Code not copied in editor
fr: Code non copié dans l'éditeur

source: - done automatically for doctest
fr: - fait automatiquement pour "doctest"

source: Code not appearing in <pre>
fr: Code n'apparaissant pas dans <pre>

source: - incompatible with no-copy
fr: - incompatible avec "no-copy"

source: Error on line %s: %s%s
fr: Erreur à la ligne %s : %s%s

source: Error in processing %s: %s
fr: Erreur dans l'interpréation de %s : %s

source: The file '%s' has some html errors in it: %s.
fr: Le fichier '%s' comporte des erreurs html : %s.

source: It can not be displayed.
fr: Il ne peut pas être présenté.

source: Canvas error: %s is an invalid colour.
fr: Erreur graphique : %s n'est pas une couleur valide.

source: Canvas error. Python info: %s.
fr: Erreur graphique. Information donnée par Python : %s.

source: Python execution error. Info: %s.
fr: Erreur d'exécution Python. Information : %s.

source: Parsing error occurred in the following Python code. Info: %s.
fr: Une erreur a été détectée dans le code Python. Information : %s.

source: Unexpected error in %s.
fr: Erreur inattendue dans %s.

source: This occurred while trying to open %s.
fr: Ceci a eu lieu lors de l'ouverture de %s.

source: The information given by Python is: %s.
fr: L'information donnée par Python est : %s.

source: This occurred while trying to process the tree for %s.
fr: Ceci a eu lieu pendant le traitement de %s fait par ElementTree.

source: The files processed so far are %s.
fr: Les fichiers traités à date sont: %s.

source: Unrecognized argument in Tutorials.get(): %s.
fr: Argument inconnu dans Tutorials.get() : %s.

source: This should never happen - and has not happened since the last bug fix!
fr: Ceci ne devrait pas survenir - et n'est pas survenu depuis la correction du fichier.

source: Please contact the developpers with a copy of the html file
fr: SVP, contactez les programmeurs avec une copie du fichier html

source: that caused this problem, and a description of what was done.
fr: qui a causé ce problème, et une description de ce que vous avez fait.

source: Type help(object) for help about object.
fr: help(objet) vous fournira de l'aide sur cet objet.

source: You cannot call help() without an argument.
fr: Vous ne pouvez pas invoquer help() sans argument.

source: %s is not defined yet
fr: %s n'est pas encore défini.

source: raw_input() request
fr: Demande de "raw_input()"

source: To use raw_input() or input(), you need Tkinter.
fr: Pour utiliser raw_input(), vous avez besoin deTkinter.

source: Follow this link if you want to know more about exceptions.
fr: Suivez ce lien si vous voulez en savoir davantage au sujet des exceptions.

source: The following example failed:
fr: L'exemple suivant n'a pas donné le résultat attendu :

source: The expected result was:
fr: Le résultat attendu était :

source: The result obtained was:
fr: Le résultat obtenu était :

source: An exception was raised:
fr: Une exception est survenue :

source: There was no test to satisfy.
fr: Il n'y avait pas de test à satisfaire.

source: Congratulation, your code passed the test!
fr: Félicitations, votre code a passé le test!

source: You code failed the test.
fr: Votre code a échoué le test.

source: Congratulation, your code passed all (%d) tests!
fr: Félicitations, votre code a passé tous les tests (%d)!

source: Your code failed all (%d) tests.
fr: Votre code a échoué tous les tests (%d).

source: Your code failed %s out of %s tests.
fr: Votre code a échoué %s des %s tests.

source: 'approximate' settings will be ignored.
fr: L'argument 'approximate' sera ignoré.

source: It is only available under Windows.
fr: Ceci n'est disponible que sous Windows.

source: WARNING: sounds multiple of 233.1 Hz may be 'noisy' on your computer.
fr: AVERTISSEMENT : les fréquences multiples de 233.1 Hz peuvent être "défecteuses" avec votre ordinateur.

source: Sound is not supported on this platform.
fr: Votre ordinateur ne permet pas la production de sons.

source: You need one of the following 2 choices:
fr: Vous avez un des deux choix suivants :

source: use MS Windows with winsound installed;
fr: utiliser Microsoft Windows avec le module winsound installé;

source: use a UNIX system that supports OSS (ossaudiodev).
fr: utiliser un système Unix qui supporte OSS (ossaudiodev).
