Repository: Focus3D/crunchy
Catalog: branches/florianbiree/crunchy/translations/*/LC_MESSAGES/crunchy.po
Languages: fr, pl

source: (Fixed) User home directory:
fr: (Fixé) répertoire de l'usager:
pl: (Ustalony) Katlog domowy użytkownika:

source: (Fixed) Temporary working directory:
fr: (Fixé) répertoire temporaire
pl: (Ustalony) Katalog tymczasowy:

source: Invalid choice for %s.dir_help
fr: Choix invalide pour %s.dir_help
pl: Nieprawidłowy wybór dla %s.dir_help

source: The valid choices are:
fr: Les choix valides sont :
pl: Prawidłowe opcje to:

source: The current value is:
fr: La valeur actuelle est :
pl: Obecna wartość to:

source: The choices for dir_help are %s
fr: Les choix pour dir_help sont %s
pl: Możliwe wybory dla dir_help to %s

source: The current value is:
fr: La valeur actuelle est :
pl: Obecna wartość to:

source: Invalid choice for %s.doc_help
fr: Choix invalide pour %s.doc_help
pl: Nieprawidłowy wybór dla %s.doc_help

source: The choices for doc_help are %s
fr: Les choix pour doc_help sont %s
pl: Możliwe wybory dla doc_help to %s

source: You can change some of the default values by Crunchy, just like you can obtain this help message, using either an interpreter prompt or an editor, and assigning the desired value to a given variable. Some of these variables are "fixed", which means that their value can not be changed by the user. - Here are the values of some variables currently used by Crunchy.
fr: Vous pouvez changez certaines des choix par défaut de Crunchy, tout comme vous pouvez voir ce message, en utilisant une invite de commande ou un éditeur, et assigner la valeur désirée à une certaine variable. Certaines de ces variables sont " fixées", ce qui veut dire que leur valeur ne peut pas être changée par l'utilisateur. - Voici les valeurs des variables présentement utilisées par Crunchy.
pl: Możesz zmienić niektóre domyślne wartości Crunchy, pobodnie jak możesz otrzymać komunikat pomocy,używając jakiegokolwiek intrepretera lub edytora i przydzielając odpowienie wartości do zmiennych. Niektóre z tych zmiennych są "ustalone",co znaczy że ich wartości nie mogą być zmienione przez użytkownika. - Tu są wartości niektórych zmiennych używanych przez Crunchy.

source: Invalid choice for %s.no_markup
fr: Choix invalide pour %s.no_markup
pl: Nieprawidłowy wybór dla %s.no_markup

source: with "image_file file_name" as a required option.
fr: avec "nom du fichier image" comme argument requis.
pl: z "image_file nazwa_pliku" są wymaganymi opcjami.

source: The choices for "pre" tag without Crunchy markup are %s
fr: Les choix pour l'étiquette "pre" utilisée par Crunchy en l'absence de balisage (markup) sont %s
pl: Wybory dla etykiety "pre" bez zaznaczenia Crunchy są %s

source: language set to:
fr: la valeur assignée à language est :
pl: Jezyk do ustawienia:

source: editarea_language also set to:
fr: la valeur assignée à editarea_language est :
pl: editarea_language także do ustawienia:

source: Note: while this is a valid choice, this choice is not available for a language provided by editarea.
fr: Notez que, bien que ceci soit un choix valide, ce choix n'est pas disponible parmi les langues définies pour editarea
pl: Nota: dopóki jest to obowiązująca opcja ,ten wybór nie jest możliwy dla języków dostarczanych przez editarea.

source: The language choice for editarea remains
fr: Le choix de la langue pour editarea demeure
pl: Wybór języka dla editarea

source: Invalid choice for %s.language
fr: Choix invalide pour %s.language
pl: Nieprawidłowy wybór dla %s.language

source: The choices for language are %s
fr: Les choix pour language sont %s
pl: Możliwe języki to %s

source: editarea_language set to:
fr: la valeur assignée à editarea_language est :
pl: editarea_language ustaw na:

source: Invalid choice for %s.editarea_language
fr: Choix invalide pour %s.editarea_language
pl: Nieprawidłowy wybór %s.editarea_language

source: The choices for editarea_language are %s
fr: Les choix valides pour editarea_language sont %s
pl: Możliwe wybory dla editarea_language to %s

source: Crunchy will attempt to provide friendly error messages.
fr: Crunchy tentera de donner des messages d'erreurs plus cordiaux.
pl: Crunchy próbuje dostarczyć przyjazny komunikat błędu.

source: Crunchy's error messages will be similar to Python's default tracebacks.
fr: Les messages d'erreurs de Crunchy seront semblables aux messages d'erreurs standard (tracebacks) de Python.
pl: Komunikaty błędów Crunchy'iego będą podobne do domyślnych Pythonowych.

source: friendly attribute must be set to True or False.
fr: Le choix de l'attribut friendly soit être soit True ou False.
pl: Przyjazne atrybuty muszą być ustawione na True lub False.

source: The choices for friendly tracebacks are %s
fr: Les choix pour l'attribut friendly sont %s
pl: Wybory dla przyjaznego namierzacza błędów to %s

source: site security set to:
fr: niveau de sécurité pour ce site est :
pl: ustaw zabezpieczenia strony to:

source: Invalid choice for %s.site_security
fr: Choix invalide pour %s.site_security
pl: Nieprawidłowy wybór dla %s.site_security

source: security set to:
fr: la valeur assignée à security est :
pl: ustaw zabezpiecznia na:

source: Invalid choice for %s.local_security
fr: Choix invalide pour %s.local_security
pl: Nieprawidłowy wybór dla %s.local_security

source: The choices for local_security levels are %s
fr: Les choix valides pour local_security levels sont %s
pl: Możliwe wartości dla local_security levels to %s

source: override_default_interpreter set to:
fr: La valeur assignée à override_default_interpreter est :
pl: override_default_interpreter ustaw na:

source: Invalid choice for %s.override_default_interpreter
fr: Choix invalide pour %s.override_default_interpreter
pl: Nieprawidłowy wybór dla %s.override_default_interpreter

source: The choices for override_default_interpreter are %s
fr: Les choix pour la variable override_default_interpreter sont %s
pl: Możliwości dla override_default_interpreter to %s

source: my_style set to:
fr: la valeur assignée à my_style set est :
pl: my_style ustawia na:

source: Invalid choice for %s.my_style
fr: Choix invalide pour %s.my_style
pl: Nieprawidłowy wybór dla %s.my_style

source: The choices for my_style are %s
fr: Les chix valides pour my_style sont %s
pl: Możliwe wartości dla my_style to %s

source: If set to True, Crunchy's default styles are replaced
fr: Si la valeur assignée est True, les styles par défaut de Crunchy sont remplacés
pl: Jeśli ustawiony na True to domyślne style Crunchy'iego zostaną zastąpione

source: by the user's choice specified in %s.styles
fr: par le choix de l'usager spécifié dans %s.styles
pl: wybory użytkownika %s.styles

source: The current value for my_style is:
fr: La valeur assignée à my_style est :
pl: Obecna wartość my_style to:

source: Your program tried to exit Crunchy.
fr: Votre programme a tenté de faire avorter Crunchy.
pl: Twój program próbował wyjść z Crunchy'iego.

source: Error on line
fr: Erreur à la ligne
pl: Błąd w linii

source: called by line
fr: appelé à la ligne
pl: Wywołany w linii

source: User's code
fr: Code de l'usager
pl: Kod użytkownika

source: Error on line %s:
fr: Erreur à la ligne %s:
pl: Błąd w linii %s:

source: There was no test to satisfy.
fr: Il n'y avait pas de tests à satisfaire.
pl: Nie było żadnego testu do spełnienia

source: Congratulations, your code passed the test!
fr: Félicitations, votre code a passé le test!
pl: Gratulacje, twój kod przeszedł test!

source: You code failed the test.
fr: Votre code a échoué le test.
pl: Twój kod nieprzeszedł testu.

source: Congratulations, your code passed all (%d) tests!
fr: Félicitation, votre code a passé tous les (%d) tests!
pl: Gratulacje, twój kod przeszedł (%d) testów!

source: Your code failed all (%d) tests.
fr: Votre code a échoué tous les (%d) tests.
pl: Twój kod nieprzeszedł (%d) testów.

source: Your code failed %s out of %s tests.
fr: Votre code a échoué %s des %s tests.
pl: Twój kod nieprzeszedł testów %s poza %s .

source: The following example failed:
fr: L'exemple suivant a échoué :
pl: Następujące przykłady zawiodły:

source: The expected result was:
fr: Le résultat attendu était :
pl: Spodziewany rezultat to:

source: The result obtained was:
fr: Le résultat obtenu est :
pl: Otrzymany rezultat:

source: An exception was raised:
fr: Une exception est survenue :
pl: Podniesiony wyjątek:

source: # no code entered by user
fr: # pas de code entré par l'usager
pl: # żaden kod nie został podany przez użytkownika

source: Crunchy: could not style the following code
fr: Crunchy ne peut pas styler le code suivant
pl: Crunchy nie może nadać stylu następującemu kodowi

source: Parsing error occurred in the following Python code. Info: %s.
fr: Erreur de compréhension du code Python suivant. Information : %s.
pl: Błąd parsowania w następującym kodzie Pythona. Info: %s.

source: Load Python file
fr: Charger le fichier Python
pl: Ładowanie pliku Python'a

source: Cancel
fr: Annuler
pl: Anuluj

source: Use 'Save and Run' to execute programs (like pygame and GUI based ones) externally.
fr: Utiliser 'Sauvegarder et exécuter' pour exécuter des programmes (comme les GUI) de façon externe.
pl: Użyj 'Zapisz i uruchom', żeby uruchomić program wewnętrznie (jak pygame czy bazujące na GUI)

source: Save Python file
fr: Sauvegarder le fichier Python
pl: Zapisz plik Python'a

source: Save and Run
fr: Sauvegarder et exécuter
pl: Zapisz i uruchom

source: Directory Listing
fr: Liste du répertoire
pl: Spis katalogów

source: Illegal path, page not found.
fr: Parcours illégal, page non trouvée.
pl: Brak dostępu do ścieżki, strona nie znaleziona

source: Crunchy could not open the page you requested. This could be for one of anumber of reasons, including:
fr: Crunchy n'a pu ouvrir la page demandée. Plusieurs causes différentes peuvent être à l'origine de cette erreur, incluant :
pl: Crunchy nie mógł otworzyć oczekiwanej przez ciebie strony. To może być jeden z wielu powodów wliczając:

source: The page doesn't exist.
fr: La page n'existe pas.
pl: Strona nie istnieje

source: The path you requested was illegal, examples of illegal paths include those containing the .. path modifier.
fr: Le parcours que vous avez demandé est illégal, possiblement en raison de ceci:
pl: Podałeś ścieżkę, do której nie ma dostępu. Ścieżka nie może zawierać modyfikatora ścieżki ..

source: The path you requested was:
fr: Le parcours requis était :
pl: Ścieżka której oczekiwałeś była:

source: Execute
fr: Exécuter
pl: Uruchom

source: Copy code sample
fr: Copier l'échantillon de code
pl: Skopiuj kod przykładu

source: Crunchy security level:
fr: Le niveau de sécurité de Crunchy:
pl: Poziom bezpieczeństwa Crunchy:

source: No elements were removed.
fr: Aucun élément n'a été éliminé.
pl: Żadne elementy nie zostały usunięte.

source: One element was removed. -
fr: Un élément a été éliminé. -
pl: Jeden element zostanie usunięty. -

source: %d elements were removed. -
fr: %d éléments ont été éliminés. -
pl: %d elementów zostało usuniętych. -

source: View report
fr: Voir le rapport
pl: Pokaż raport

source: Confirm the security levels
fr: Confirmer le niveau de sécurité
pl: Zatwierdź poziom bezpieczeństwa

source: Before browsing any further ...
fr: Avant de fureter davantage ...
pl: Zanim wybierzesz jakiś dalszy ...

source: Do you wish to retain the existing settings for these sites?
fr: Désirez-vous conserver les choix existants pour ces sites?
pl: Czy chcesz zachować istniejące ustawienia dla tych stron?

source: You can change any of them before clicking on the approve button.
fr: Vous pouvez changer ceux que vous voulez avant de cliquer sur le bouton d'approbation.
pl: Możesz zmienić każde z nich zanim zatwierdzisz przyciskiem.

source: Approve
fr: Approbation
pl: Zatwierdź

source: Remove all
fr: Éliminez tout.
pl: Usuń wszystkie

source: remove from list
fr: Retirer de la liste.
pl: usuń z listy

source: Removed: tag not allowed
fr: Éliminé: étiquette non permise.
pl: Usunięte: etykieta niedozwolona

source: Tag removed
fr: Étiquette éliminée
pl: Etykieta usunięta

source: Number of times
fr: Nombre de fois
pl: Ilość razy

source: Removed: attribute, or attribute value not allowed
fr: Éliminé: attibut ou valeur de l'attribut non permis.
pl: Usunięte:atrybut albo wartość atrybutu niedozwolona

source: Tag
fr: Étiquette
pl: Etykieta

source: Attribute
fr: Attribut
pl: Atrybut

source: Value (if relevant)
fr: Valeur (si pertinente)
pl: Wartość (jeśli ma znaczenie)

source: Removed: style tag or attribute not allowed
fr: Éliminé: étiquette style ou attribut non permis
pl: Usunięte: styl etykiety lub atrybut są niedozwolone

source: Attribute (if relevant)
fr: Attribut (si pertinent)
pl: Atrybut (jeśli ma znaczenie)

source: Value
fr: Valeur
pl: Wartość

source: You may select a site specific security level:
fr: Vous pouvez choisir un niveau de sécurité spécifique à ce site.
pl: Możesz wybrać specyficzny dla strony poziom bezpieczeństwa:

source: If you want to preserve the existing selection,
fr: Si vous désirez préserver le choix existant,
pl: Jeśli chcesz zachować obecny wybór ,

source: simply dismiss this window by clicking on the X above.
fr: veuillez fermer la fenêtre en cliquant sur le X ci-dessus.
pl: po prostu odrzuć to okno klikając na X.

source: Select site security level
fr: Choisissez le niveau de sécurité
pl: Wybierz poziom bezpieczeństwa strony

source: Selection of a 'display MODE' will result in the same processing by Crunchy as the selection of 'MODE' except that no interactive elements (such as a Python interpreter) will be inserted in the page, thereby preserving the normal browser sandbox to protect your computer from malicious code.
fr: La sélecton de 'display MODE' aura comme résultat le même traitement par Crunchy que la sélection de 'MODE' sauf qu'aucun élément interactif (tel qu'un interprète Python) ne sera inséré dans la page, préservant ainsi les barrières de sécurité normale de votre fureteur protégeant votre ordinateur contre des codes malicieux.
pl: Wybór 'widoku' odniesie rezultat w tym samym procesie Crunchy tak jak wybór 'trybu' wymaga, żeby żadne elementy interaktywne (takie jak interpreter Pythona) nie mogą być na stronie,tym samym zachowując normalną przeglądarkę piaskownica chroni twój komputer przed złośliwym kodem.

source: Crunchy will remove any pre-existing javascript code on the page as well as a number of html elements that could be used to hide some javascript code.
fr: Crunchy enlevera tout code javascript inséré auparavant dans la page ainsi qu'un nombre de balises html qui pourraient être utilisées pour camoufler des codes javascript.
pl: Crunchy usunie każdy istniejący kod javascript na tej stronie oraz elementy html mogące ukryć taki kod

source: 'trusted' should only be used for sites that you are convinced will not attempt to insert malicious code. Sites that allow users to post comments, or worse, that allow users to edit (such as wikis) should not be set to 'trusted'. With 'trusted' selected, Crunchy will display the site as closely as it can to the wayt the original looked using only your browser.
fr: 'trusted' devrait être seulement utilisé lorsque vous êtes convaincu que le site est conçu sans possibilité de code malicieux. Les sites qui permettent aux utilisateurs d'ajouter des commentaires, ou pire, d'éditer le site (tels que les wikis) ne devraient pas se mériter le choix de 'trusted'. Avec le choix 'trusted', Crunchy reproduit le site aussi fidèlement qu'il le peut, si on compare avec ce que votre fureteur donne sans Crunchy.
pl: 'zaufane' powinna być używana tylko do stron, które nie zawierają złośliwego kodu. Strony takie jak fora czy takie jak Wikipedia nie powinny być 'zaufane' Z opcją 'zaufana' Crunchy wyświetli stronę najlepiej jak tylko może

source: 'normal' will attempt to display the sites the same ways as 'trusted' does except that it will remove any styling deemed suspicious (see the docs for details) and will validate any image source before allowing the image to be displayed. If the site contains many images, this validation process will slow down the display. Images that can not be validated will not be shown. Each image is validated only once during a given Crunchy session.
fr: 'normal' fera en sorte que Crunchy traitera le site presque comme pour 'trusted' sauf qu'il éliminera tout style apparaissant suspect (voir la documentation) et validera tout fichier image avant de permettre son inclusion dans la page. Si la page contient plusieurs images, le processus de validation prendra un certain temps. Chaque image n'est validée qu'une seule fois durant une même session avec Crunchy.
pl: 'normalny' wyświetli strony tą samą drogą jak 'zaufany'. Usunie style, które są podejrzane i sprawdzi kod obrazków zanim je wyświetli. Jeśli strona zawiera dużo obrazków walidacja zajmie troche czasu. Nie zwalidowane obrazki nie zostaną wyświetlone. Każdy obrazek jest walidowany jedynie na czas sesji Crunchy'iego

source: 'strict' will remove all styling and image on the page. It will result in the fastest display, but one that will likely be the least visually appealing.
fr: 'strict' fera en sorte que tous les styles et images seront éliminés. C'est le choix le plus rapide, mais d'apparence visuelle le moins intéressant.
pl: 'restrykcyjny' usunie style i obrazy ze strony. Gwarantuje to najszybsze działąnie, ale najgorsze efekty wizualne

source: Host:
fr: Hote:

source: Confirmation code:
fr: Code de confirmation :
pl: Kod potwierdzający:

source: builtins not defined in console yet.
fr: Les "builtins" ne sont pas définis en ce moment.
pl: builtins nie zdefiniowane jeszcze w konsoli.

source: Execute as external program
fr: Exécuter comme programme externe.
pl: Uruchom jako wewnętrzyny program

source: Execute as separate thread
fr: Exéctuer comme processus (thread) distinct
pl: Uruchom jako oddzielny wątek

source: Type %s.help for more information.
fr: Entrez %s.help pour plus d'information.
pl: Napisz %s.help aby uzyskać więcej informacji.
